#### CoordinatePlaneVisibility Enumeration

---

|  |
| --- |
| See Also |

Visibility settings for ReferencePoint element's coordinate reference planes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum CoordinatePlaneVisibility ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CoordinatePlaneVisibility ``` |

| Visual C++ |
| --- |
| ``` public enum class CoordinatePlaneVisibility ``` |

# Members

| Member name | Description |
| --- | --- |
| Never | Never visible. |
| WhenSelected | Visible when selected. |
| Always | Always Visible. |

# See Also

Autodesk.Revit.DB Namespace